# Задание 1

# a = input('Как вас зовут? ')
# b = int(input('В каком году Вы родились? '))
# print(f'Значит Вас зовут {a} и Вам {2022 - b} лет/года')

# Задание 2

# sec = int(input('Введите время в секундах: '))
# min = sec // 60
# hour = min // 60
# sec_1 = sec - min * 60
# min_1 = min - hour * 60
#
# print(f'{hour} час:{min_1} минут:{sec_1} секунд')

# Задание 3

# n = input('Введите число: ')
# n_2 = n+n
# n_3 = n+n+n
#
# print(int(n)+int(n_2)+int(n_3))
# print(f'{n} + {n_2} + {n_3} =',int(n)+int(n_2)+int(n_3))

# Задание 4
# a = int(input('Введите целое положительное число: '))
# n = a % 10
# a = a // 10
# while a > 0:
#     if a % 10 > n:
#         n = a % 10
#     a = a // 10
# print(n)

# Задание 5, 6

# a = int(input('Введите ВЫРУЧКУ вашей организации: '))
# b = int(input('Введите ИЗДЕРЖКИ вашей организации: '))
#
# c = a - b
#
# r = c / a
# print('Выручка компании составляет: ',c,'руб.')
# if c > 0 and c != 0:
#     print('Ваша компания работает с прибылью. Наши поздравления!')
#     print('Рентабельность компании составила: ',r, '%')
#     n = int(input('Введите численность компании: '))
#     print('Доход в расчете на каждого сотрудника составит:', c / n, 'руб.')
# elif c < 0:
#     print('Ваша компания работает с убытком. Вам следует пересмотреть стратегию развития!')
# else:
#     print('Нулевой баланс.')

# Задание 7

# a = int(input('Введите число км с которого вы начинали: '))
# b = int(input('Введите число км которых вы хотите достичь: '))
#
# day = 1
#
# while a < b:
#     a = a * 1.1
#     day += 1
#     print(f'День {day}: {a:.2f} км')


# я хотела ввести третью переменную смысл вроде от этого не поменялся, но цикл бесконечный выходит одно и тоже считает без break.
# А с break останавливаетс как будто не видит условие что c < b
# не могу понять посуму? :
a = int(input('Введите число км с которого вы начинали: '))
b = int(input('Введите число км которых вы хотите достичь: '))

c = a * 1.1
day = 1

while c < b :
    c = a * 1.1
    day += 1
    print(f'День {day}: {c:.2f} км')
    break